Revit 2024 API
KeyBasedTreeEntriesLoadResults Class
 This class contains the results and status information regarding an attempt to load the KeyBasedTreeEntries from an External Resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class KeyBasedTreeEntriesLoadResults : IDisposable
Visual Basic
Public Class KeyBasedTreeEntriesLoadResults _
	Implements IDisposable
Visual C++
public ref class KeyBasedTreeEntriesLoadResults : IDisposable
Remarks
A KeyBasedTreeEntriesLoadResults object is returned by the KeynoteTable or AssemblyCodeTable API methods LoadFrom() and Reload() so that callers can determine whether the KeynoteTable or AssemblyCodeTable was updated successfully and what, if any, errors occurred.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults
See Also
KeyBasedTreeEntriesLoadResults Members
Autodesk.Revit.DB Namespace